FAX 番号でも使える！ vim-textobj-denwabangou を書いた
=====================================================

この README は [FAX Advent Calendar](http://www.adventar.org/calendars/324) の3日目の記事です．

![スクリーンショット](http://gifzo.net/LuRcNPAkrw.gif)

FAX について書こう！と思い，FAX 番号にマッチするテキストオブジェクトプラグイン，vim-textobj-fax を書こうと思ったのですが，FAX 番号って要は電話番号で普通の電話番号と見分けが付かないんですね．FAX は数えるほどしか触ったこと無いので全然知りませんでした．
なので，涙をのんで任意の電話番号にマッチするテキストオブジェクトプラグインで妥協することにしました．

そして出来たのがこの vim-textobj-denwabangou です．
プラグイン名からも察していただけると思いますが，**日本の電話番号専用** です（海外の方々には大変申し訳ございません（？））．

日本の電話番号（正しくは電気通信番号）の指定状況は総務省のページで公開されているので，それに従ってマッチするかどうかを判定しています．最近のトピックだと，`070` で始まる携帯電話番号にも対応しています．

[電気通信番号指定状況](http://www.soumu.go.jp/main_sosiki/joho_tsusin/top/tel_number/number_shitei.html)

区切りの `-` はあっても無くても動作するようになっているため，`09012345678` でも `090-1234-5678` でもマッチします．
これでテキストの中に FAX 番号などが記載されていても面倒を感じることは少なくなるはずです．思う存分 FAX 番号を書きましょう．

なお，このプラグインは [vim-textobj-user](https://github.com/kana/vim-textobj-user) に依存していますので，先にこちらをインストールしておいてください．デフォルトでは `id` と `ad` にマッピングが割り当てられていますので，例えば `vid` で FAX 番号選択，`yid` で FAX 番号をコピーなどが行えます．

ちなみに，最初は [こちらの正規表現](http://blog.livedoor.jp/nipotan/archives/51644244.html) を Vim 用にちょっと書き換えて終わらせようと思っていたのですが，どうもうまくいかなかったので自前でフォーマットを調べて正規表現を書きました．無念．

## まとめ

![FAX!FAX!](https://dl.dropboxusercontent.com/u/2753138/fax.jpeg)

FAX をやっていく．
